Белгипрозем_2017/src/Documents/мКалькуляция/мКалькуляция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мКалькуляция</name>
  <registerRecords>AccumulationRegister.ОстаткиПроизводство</registerRecords>
  <attributes>
    <name>НоменклатураПроизводства</name>
    <type>
      <types>CatalogRef.мНоменклатураПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

Белгипрозем_2017/src/AccumulationRegisters/ОстаткиПроизводство/ОстаткиПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураПроизводства</name>
    <type>
      <types>CatalogRef.мНоменклатураПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Калькуляция</name>
    <type>
      <types>DocumentRef.мКалькуляция</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/Documents/мКалькуляция/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр ОстаткиПроизводство Приход
	Движения.ОстаткиПроизводство.Записывать = Истина;
	Движение = Движения.ОстаткиПроизводство.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.НоменклатураПроизводства = НоменклатураПроизводства;
	Движение.Калькуляция = ЭтотОбъект.Ссылка;
	Движение.Количество = Количество;

КонецПроцедуры
